uhnp/src/InformationRegisters/НомераСпособовЗакупокВЕИС/НомераСпособовЗакупокВЕИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомераСпособовЗакупокВЕИС</name>
  <resources>
    <name>КодЕИС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеЕИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СпособВыбораПоставщика</name>
    <type>
      <types>EnumRef.СпособыВыбораПоставщика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗакрытыйКонкурс</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВЭлектроннойФорме</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/СпособыВыбораПоставщика/СпособыВыбораПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВыбораПоставщика</name>
  <enumValues>
    <name>ЗакупкаУЕдинственногоПоставщика</name>
  </enumValues>
  <enumValues>
    <name>Конкурс</name>
  </enumValues>
  <enumValues>
    <name>Аукцион</name>
  </enumValues>
  <enumValues>
    <name>ЗапросКотировок</name>
  </enumValues>
  <enumValues>
    <name>ЗапросПредложений</name>
  </enumValues>
  <enumValues>
    <name>КвалификационныйОтбор</name>
  </enumValues>
  <enumValues>
    <name>Редукцион</name>
  </enumValues>
  <enumValues>
    <name>КонкурентныеПереговоры</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКонкурсУМсп</name>
  </enumValues>
  <enumValues>
    <name>УдалитьАукционУМсп</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросКотировокУМсп</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросПредложенийУМсп</name>
  </enumValues>
  <enumValues>
    <name>КонкурсУМсп</name>
  </enumValues>
  <enumValues>
    <name>АукционУМсп</name>
  </enumValues>
  <enumValues>
    <name>ЗапросКотировокУМсп</name>
  </enumValues>
  <enumValues>
    <name>ЗапросПредложенийУМсп</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/ПрограммаЗакупок/ПрограммаЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрограммаЗакупок</name>
  <basedOn>Document.ПрограммаЗакупок</basedOn>
  <registerRecords>InformationRegister.ВерсииПрограммыЗакупок</registerRecords>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУтверждения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакупкаИнновационнойВысокотехнологичнойПродукцииИЛекарственныхСредств</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОрганизаторЗакупки</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияДляЗаключенияДоговора</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗакупок</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНеПревышаетРазмерСт4_15</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ОбоснованиеВнесенияИзменений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ЕИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПрограммаЗакупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеИзменений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗакупокОкончание</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЗакупокИнновационных</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЗакупокИсключаемыхМСП</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодовойОбъемЗакупокМСП</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаИнновационныхПрошлыйГод</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЗакупокИнновационныхОтчетный</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЗакупокИнновационныхИсключаемых</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЗакупокИнновационныхМСП</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаИнновационныхМСППрошлыйГод</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтрокиПланаЗакупок</name>
    <attributes>
      <name>СтрокаПланаЗакупок</name>
      <type>
        <types>DocumentRef.СтрокаПланаЗакупок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтрокиПланаВалютные</name>
    <attributes>
      <name>СтрокаПланаЗакупок</name>
      <type>
        <types>DocumentRef.СтрокаПланаЗакупок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/НомераСпособовЗакупокВЕИС/ManagerModule.bsl
Процедура ЗаполнитьПервоначальнымиНастройками() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ Разрешенные 
	                |	НомераСпособовЗакупокВЕИС.СпособВыбораПоставщика КАК СпособВыбораПоставщика,
	                |	НомераСпособовЗакупокВЕИС.ЗакрытыйКонкурс КАК ЗакрытыйКонкурс,
	                |	НомераСпособовЗакупокВЕИС.ВЭлектроннойФорме КАК ВЭлектроннойФорме
	                |ИЗ
	                |	РегистрСведений.НомераСпособовЗакупокВЕИС КАК НомераСпособовЗакупокВЕИС";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	//ЗакупкаУЕдинственногоПоставщика
	СпособВыбораПоставщика = Перечисления.СпособыВыбораПоставщика.ЗакупкаУЕдинственногоПоставщика;
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Ложь);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Ложь);		
	КонецЕсли;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Истина);		
	КонецЕсли;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Истина);		
	КонецЕсли;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Ложь);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Ложь);		
	КонецЕсли;	
	
	//Конкурс
	СпособВыбораПоставщика = Перечисления.СпособыВыбораПоставщика.Конкурс;
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Ложь);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Ложь);		
	КонецЕсли;	
	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Истина);		
	КонецЕсли;	
	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Истина);		
	КонецЕсли;	
	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Ложь);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Ложь);		
	КонецЕсли;	
	
	//Аукцион
	СпособВыбораПоставщика = Перечисления.СпособыВыбораПоставщика.Аукцион;
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Ложь);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Ложь);		
	КонецЕсли;	
	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Истина);		
	КонецЕсли;	
	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Истина);		
	КонецЕсли;	
	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Ложь);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Ложь);		
	КонецЕсли;		
	
	//ЗапросКотировок
	СпособВыбораПоставщика = Перечисления.СпособыВыбораПоставщика.ЗапросКотировок;
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Ложь);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Ложь);		
	КонецЕсли;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Истина);		
	КонецЕсли;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Истина);		
	КонецЕсли;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Ложь);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Ложь);		
	КонецЕсли;		
	
	//ЗапросПредложений
	СпособВыбораПоставщика = Перечисления.СпособыВыбораПоставщика.ЗапросПредложений;
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Ложь);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Ложь);		
	КонецЕсли;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Истина);		
	КонецЕсли;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Истина);		
	КонецЕсли;	
	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Ложь);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Ложь);		
	КонецЕсли;		
	
	//КвалификационныйОтбор
	СпособВыбораПоставщика = Перечисления.СпособыВыбораПоставщика.КвалификационныйОтбор;
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Ложь);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Ложь);		
	КонецЕсли;	
	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Истина);		
	КонецЕсли;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Истина);		
	КонецЕсли;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Ложь);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Ложь);		
	КонецЕсли;		
	
	//Редукцион
	СпособВыбораПоставщика = Перечисления.СпособыВыбораПоставщика.Редукцион;
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Ложь);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Ложь);		
	КонецЕсли;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Истина);		
	КонецЕсли;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Истина);		
	КонецЕсли;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Ложь);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Ложь);		
	КонецЕсли;		
	
	//КонкурентныеПереговоры
	СпособВыбораПоставщика = Перечисления.СпособыВыбораПоставщика.КонкурентныеПереговоры;
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Ложь);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Ложь);		
	КонецЕсли;	
	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Истина);		
	КонецЕсли;	
	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Истина);		
	КонецЕсли;	
	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Ложь);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Ложь);		
	КонецЕсли;		
	
	//КонкурсУМсп
	СпособВыбораПоставщика = Перечисления.СпособыВыбораПоставщика.КонкурсУМсп;
	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Истина);		
	КонецЕсли;	
	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Истина);		
	КонецЕсли;	
	
	
	//АукционУМсп
	СпособВыбораПоставщика = Перечисления.СпособыВыбораПоставщика.АукционУМсп;
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Истина);		
	КонецЕсли;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Истина);		
	КонецЕсли;	
	
		
	//ЗапросКотировокУМсп
	СпособВыбораПоставщика = Перечисления.СпособыВыбораПоставщика.ЗапросКотировокУМсп;
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Истина);		
	КонецЕсли;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Истина);		
	КонецЕсли;	
	
	//ЗапросПредложенийУМсп
	СпособВыбораПоставщика = Перечисления.СпособыВыбораПоставщика.ЗапросПредложенийУМсп;
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Ложь);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Ложь,Истина);		
	КонецЕсли;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("СпособВыбораПоставщика",СпособВыбораПоставщика);
	Отбор.Вставить("ЗакрытыйКонкурс", Истина);
	Отбор.Вставить("ВЭлектроннойФорме", Истина);
	
	Если Результат.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,Истина,Истина);		
	КонецЕсли;	
	
КонецПроцедуры

Процедура СоздатьЗаписьНастроекПоШаблону(СпособВыбораПоставщика,ЗакрытыйКонкурс,ВЭлектроннойФорме)
	
	МенеджерЗаписи = РегистрыСведений.НомераСпособовЗакупокВЕИС.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.СпособВыбораПоставщика = СпособВыбораПоставщика;
	МенеджерЗаписи.ЗакрытыйКонкурс = ЗакрытыйКонкурс;
	МенеджерЗаписи.ВЭлектроннойФорме = ВЭлектроннойФорме;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры	

Функция ПроверкаНаличияНомераСпособаЗакупокВЕИСПоПрограммеЗакупок(ПрограммаЗакупок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПрограммаЗакупок",ПрограммаЗакупок);
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ПрограммаЗакупокСтрокиПланаЗакупок.СтрокаПланаЗакупок.ВЭлектроннойФорме КАК ВЭлектроннойФорме,
	 |	ПрограммаЗакупокСтрокиПланаЗакупок.СтрокаПланаЗакупок.СпособВыбораПоставщика КАК СпособВыбораПоставщика,
	 |	ПрограммаЗакупокСтрокиПланаЗакупок.СтрокаПланаЗакупок.ЗакрытаяЗакупка КАК ЗакрытаяЗакупка,
	 |	ПрограммаЗакупокСтрокиПланаЗакупок.СтрокаПланаЗакупок.Ссылка КАК Ссылка
	 |ПОМЕСТИТЬ ПрограммаЗакупок
	 |ИЗ
	 |	Документ.ПрограммаЗакупок.СтрокиПланаЗакупок КАК ПрограммаЗакупокСтрокиПланаЗакупок
	 |ГДЕ
	 |	ПрограммаЗакупокСтрокиПланаЗакупок.Ссылка = &ПрограммаЗакупок
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ПрограммаЗакупок.ВЭлектроннойФорме КАК ВЭлектроннойФорме,
	 |	ПрограммаЗакупок.СпособВыбораПоставщика КАК СпособВыбораПоставщика,
	 |	ПрограммаЗакупок.ЗакрытаяЗакупка КАК ЗакрытаяЗакупка,
	 |	ПрограммаЗакупок.Ссылка.Номер КАК НомерСтроки
	 |ИЗ
	 |	ПрограммаЗакупок КАК ПрограммаЗакупок
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераСпособовЗакупокВЕИС КАК НомераСпособовЗакупокВЕИС
	 |		ПО ПрограммаЗакупок.ВЭлектроннойФорме = НомераСпособовЗакупокВЕИС.ВЭлектроннойФорме
	 |			И ПрограммаЗакупок.СпособВыбораПоставщика = НомераСпособовЗакупокВЕИС.СпособВыбораПоставщика
	 |			И ПрограммаЗакупок.ЗакрытаяЗакупка = НомераСпособовЗакупокВЕИС.ЗакрытыйКонкурс
	 |			И (НомераСпособовЗакупокВЕИС.КодЕИС <> 0)
	 |ГДЕ
	 |	НомераСпособовЗакупокВЕИС.СпособВыбораПоставщика ЕСТЬ NULL";

	Результат = Запрос.Выполнить();
	Возврат Результат;
КонецФункции
